Grasshopper.Versioning.SyncLatestVersionData
Attempts to download the latest version information.
The downloaded data (if the download works) will eventually be stored at:
Grasshopper.Folders.LatestVersionFile

Grasshopper.Versioning.LatestVersionData
Gets the currently most up-to-date latest version data.
Returns: