Grasshopper.Folders.LatestVersionUrl
Gets the url of the latest version data.

Grasshopper.Folders.LatestVersionFile
Gets the text file location where Grasshopper will save the latest version information.