Grasshopper.Plugin.GH_LatestVersionInfo.DataAge
Represents how recent this information is.

Grasshopper.Plugin.GH_LatestVersionInfo.CurrentVersion
This field represents Grasshoppers current version.

Grasshopper.Plugin.GH_LatestVersionInfo.LatestVersion
This field represents (to the best of our knowledge) the latest available version.

Grasshopper.Plugin.GH_LatestVersionInfo.DownloadUrl
This field contains the download page URL where the latest version can be got.

Grasshopper.Plugin.GH_LatestVersionInfo.InstallerUrl
This field points directly to the installer url.

Grasshopper.Plugin.GH_LatestVersionInfo.IsValid
Gets whether this instance is valid. GH_LatestVersionInfo is invalid if there is no cached latest version data.

Grasshopper.Plugin.GH_LatestVersionInfo.IsUpToDate
Gets whether the current Grasshopper is indeed up to date.

Grasshopper.Plugin.GH_LatestVersionInfo.#ctor(System.TimeSpan,GH_IO.Types.GH_Version,System.String,System.String)
This class does not have a pulic constructor, please use the EmitNewVersionInfo() method.

Grasshopper.Plugin.GH_LatestVersionInfo
Provides mechanisms for synching and testing online latest version data.